bedV03MomentumSource/0/T.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 0 0 1 0 0 0];

internalField       uniform 300;

boundaryField
{   
    inletAir
    {
        type            fixedValue;
        value           $internalField;
    }
    
    inletWater
    {
        type            fixedValue;
        value           $internalField;
    }

    bottom
    {
        type            inletOutlet;
        phi             phi.air;
        inletValue      $internalField;
        value           $internalField;
    }
    sym
    {
    	type		symmetry;
    }
    walls
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
