bedV03MomentumSource/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [1 -1 -2 0 0 0 0];

internalField       uniform 1e5;

boundaryField
{
    inletAir
    {
        type            calculated;
        value           $internalField;
    }
    
    inletWater
    {
        type            calculated;
        value           $internalField;
    }
    
    bottom
    {
        type            calculated;
        value           $internalField;
    }

    sym
    {
    	type		symmetry;
    }
    
    walls
    {
        type            calculated;
        value           $internalField;
    }
}

// ************************************************************************* //
