bedV03MomentumSource/constant/AccSourcefvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

accelerationSource
{
 type            accelerationSource;

 select          all;

 U               U.water;

 velocity        scale;
 value           (5 0 0);
 scale
 {
     type            halfCosineRamp;
     start           0;
     duration        10;
 }
}

// ************************************************************************* //
